templates/CreateNewApp.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:exam="http://www.mendix.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <exam:CreateNewApp>
         <ProjectName><%= ProjectName %></ProjectName>
         <% if (ProjectSummary) { %>
         <ProjectSummary><%= ProjectSummary %></ProjectSummary>
         <% } else { %>
         <ProjectSummary xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:nil="true"/>
         <% } %>
         <User><%= User %></User>
         <ApiKey><%= ApiKey %></ApiKey>
         <TemplateUUID>c00d0363-23d2-4ebe-ab63-76c9efe565c0</TemplateUUID>
      </exam:CreateNewApp>
   </soapenv:Body>
</soapenv:Envelope>
